[
    {
      "filename": "pihlajisto_001.jpg",
      "caption": "Master of wine @peterkofmwf said \"There is good Burgundy and there is cheap Burgundy, but there is no good cheap Burgundy\". Well wines like this 2021 Hautes-Cotes de Beaune from @bouchard_aine_fils challenge this. It is perfectly good everyday Chardonnay that won't break your bank. The nose has pear and green apple, the mouthfeel is oily with more green notes. Especially when the wine warms up the acidic notes subside and the round fruity notes take over. A good value for money.\n\nRating 4/5, great value for money.\n\n#bourgogne #burgundy #hautescotesdebeaune #cotedor #bouchardainefils",
      "rating": 4,
      "country": "France",
      "producer": "Bouchard Aine & Fils",
      "name": "Hautes-Cotes de Beaune",
      "vintage": "2021"
    },
    {
      "filename": "pihlajisto_002.jpg",
      "caption": "I have recently been into creamy South-African Chardonnay after @ilkka_siren recommended me one a few months back. These wines often have fun tropical notes such as pineapple. This spesific Chardonnay comes from @lanzeracestate in the Stellenbosch and it has notes of pineapple, vanilla and oak.\n\nFun everyday wine that's easy to enjoy by itself.",
      "rating": 3.75,
      "country": "South Africa",
      "producer": "Lanzerac Estate",
      "name": "Chardonnay",
      "vintage": ""
    },
    {
      "filename": "pihlajisto_003.jpg",
      "caption": "With the price of land and labour in the USA it's wonderful that producers like @kenwoodvineyards can still produce well made wines at a reasonable price. This 2019 Zinfandel is more restrained than some big American Zins. The tasting notes include blueberry, spice and strawberry jam. The aftertaste is quite short.\n\nEasy everyday wine.\n\nPhoto credits @lynlishphotography",
      "rating": 3.75,
      "country": "USA",
      "producer": "Kenwood Vineyards",
      "name": "Zinfandel",
      "vintage": "2019"
    },
    {
      "filename": "pihlajisto_004.jpg",
      "caption": "2023 is supposed to be a great year for whites in Burgundy and our first bottle from that vintage did not disappoint. This regional Bourgogne from @louislatour1797 has a great nose of freshly cut green apple. The pallet has more green apple flavours with a hint of butter. Good acids. Great burgundy for a fair price.\n\nExcellent value for money.",
      "rating": 4.25,
      "country": "France",
      "producer": "Louis Latour",
      "name": "Bourgogne",
      "vintage": "2023"
    },
    {
      "filename": "pihlajisto_005.jpg",
      "caption": "Trying wines from made from different areas and grape varietals is always fun. This 2023 Clos Ancestral from @familiatorreswines is made partly from the ancient Moneu grape varietal that the winery is bringing back in Penedes, Spain. The wine has a nose of strawberry jam. The pallet has more red fruit along with some pepper and a rubber note. Quite enjoyable wine.\n\nGood everyday wine.",
      "rating": 3.5,
      "country": "Spain",
      "producer": "Familia Torres",
      "name": "Clos Ancestral",
      "vintage": "2023"
    },
    {
      "filename": "pihlajisto_006.jpg",
      "caption": "There is no place for Syrah like Hermitage. This was proved again by this 2016 Hermitage by @domaineguigal which was drinking beautifully yesterday. The wine has a powerful nose of prune, chocolate and oak. The pallet has some classic Syrah pepper notes and lots of smooth red and dark fruits. Long aftertaste.\n\nA true classic.",
      "rating": 4.5,
      "country": "France",
      "producer": "Domaine Guigal",
      "name": "Hermitage",
      "vintage": "2016"
    },
    {
      "filename": "pihlajisto_007.jpg",
      "caption": "Riesling is popular here in Finland and for good reason. German white wines can rival the best white wines from France or the US and they are often better priced. Today's wine is the 2023 Riesling from @buerklinwolf from the Pfalz. They are one the best producers in Germany and their entry level wine has a nose of pear and faint hint of barnyard. The pallet has lime and some sweetness in the aftertaste. The mouthfeel is light but the intensity is good. A well made and fun wine.\n\nMore interesting than your average Riesling.",
      "rating": 4,
      "country": "Germany",
      "producer": "Dr. Bürklin-Wolf",
      "name": "Riesling",
      "vintage": "2023"
    },
    {
      "filename": "pihlajisto_008.jpg",
      "caption": "Best wine I've had so far in 2025. This 2019 #jcacheux Nuits-Saint-Georges Au Bas de Combe confirms my assessment that the 2019 is a great vintage in Burgundy. The wine has a strong nose of red cherry and the taste has more red fruit with a hint of vanilla. It's like sticking your head to a berry bush and it makes you want to keep drinking more of it.\n\nWhen red burgundy is done right, it's the best wine in the world.",
      "rating": 5,
      "country": "France",
      "producer": "J. Cacheux et Fils",
      "name": "Nuits-Saint-Georges Au Bas de Combe",
      "vintage": "2019"
    },
    {
      "filename": "pihlajisto_009.jpg",
      "caption": "2023 delivers again! Finland is normally Riesling country but people here should try unoaked Chardonnay like this 2023 @lachablisienne1923 Le Finage which show's a side of Chardonnay that isn't familiar to everyone. The nose of the wine has green apple and some saltiness of the sea. The pallet has lime, honey and some more green flavours. The finish is quite long.\n\nGreat value for money.",
      "rating": 4,
      "country": "France",
      "producer": "La Chablisienne",
      "name": "Le Finage",
      "vintage": "2023"
    },
    {
      "filename": "pihlajisto_010.jpg",
      "caption": "Very big wine. This wine was one of the most famous garage wines from Bordeaux and it was even controversial with its bold, almost new world style. The 2015 marojallia_sas has a nose of smoke, liquorice and black fruit. With time you can find some blue fruit notes but the finish stays very dry and smoky with hints of tobacco.\n\nIf you like big wines you might score it even higher.",
      "rating": 4.25,
      "country": "France",
      "producer": "Marojallia",
      "name": "Marojallia",
      "vintage": "2015"
    }
]